`timescale 1ns / 1ps

module key_test;

    // 参数与时钟定义 (50MHz 系统时钟对应 20ns 周期)
    localparam integer CLK_PERIOD = 20;

    // 接口信号
    reg  clk;
    reg  rst_n;
    reg  key_in;      // 外部异步按键输入 (默认高电平，按下为低电平)
    wire key_pulse;   // 消抖后输出的单周期脉冲

   key_debounce # (
    .CNT_MAX(10)    //将原先的20MS 缩小为 10*20ns，即10拍一直低电平即认为按键按下
  ) uut (
    .clk(clk),
    .rst_n(rst_n),
    .key_in(key_in),
    .key_pulse(key_pulse)
  );

    // 50MHz 时钟源生成 (周期 20ns)
    initial begin
        clk = 1'b0;
        forever #(CLK_PERIOD / 2) clk = ~clk;
    end

    // 激励主逻辑：全程只有 1.5 微秒
    initial begin
        // 1. 初始化并保持高电平
        rst_n  = 1'b0;
        key_in = 1'b1;

        // 2. 释放复位
        #60;
        rst_n = 1'b1;
        #100;

        // 场景 1: 机械按下抖动，模拟一会高电平，一会低电平，共 8 拍
        key_in = 1'b0; #40;  // 低 2 拍
        key_in = 1'b1; #60;  // 高 3 拍
        key_in = 1'b0; #20;  // 低 1 拍
        key_in = 1'b1; #40;  // 高 2 拍

        // 场景 2: 稳定按下
        // 在此处：cnt 会从 0 数到 9，在第 10 拍 key_pulse 会产生一个完美的脉冲
        key_in = 1'b0;
        #500;   // 低25拍

        // -------------------------------------------------------------
        // 场景 3: 机械释放抖动，还是模拟抖动，共 9 拍
        // -------------------------------------------------------------
        key_in = 1'b1; #40; // 高 2 拍
        key_in = 1'b0; #60; // 低 3 拍
        key_in = 1'b1; #20; // 高 1 拍
        key_in = 1'b0; #40; // 低 2 拍
        key_in = 1'b1; #20; // 高 1 拍

        // -------------------------------------------------------------
        // 场景 4: 稳定释放 (恢复高电平保持)
        // -------------------------------------------------------------
        key_in = 1'b1;
        #500;

        $stop;
    end

endmodule
